Tekla Open API Reference for Tekla Structures 2025
Model.GetPhases Method
 Returns information about the current model's phases.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PhaseCollection GetPhases()
Public Function GetPhases As PhaseCollection
Return Value
Type: PhaseCollection
A PhaseCollection instance on success.
See Also
Reference
Model Class
Tekla.Structures.Model Namespace